[
  {
    "name": "Frederic Dupas",
    "date": "30/06/2022",
    "feedback": "Asma is teaching physics to my son George. She is very proactive and my son makes significant progress thanks to her.",
    "subject": "GCSE or National 3-5 Physics tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Shree Ghandinesen",
    "date": "21/09/2021",
    "feedback": "Asma has been an excellent tutor for my daughter, who was initially struggling with her confidence in GCSE Maths. Asma is meticulous in her teaching and she is always well prepared for her lessons. She explains the concepts clearly in a way that is easy to follow and understand. Additional practice questions and guidance is always provided upon request and she has supported my daughter towards a very good grade at her recent mock examination. I would like to thank Asma for her guidance and support, and I highly recommend her as a tutor.",
    "subject": "GCSE or National 3-5 Maths tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Esther Iyekekpolor",
    "date": "17/05/2020",
    "feedback": "Due to Pandemic, homeschooling has been a struggle. My daughter needed help in Science. Finding you on First Tutors has now made Danielle begin to enjoy science. She tells me that you really explain things very well and she is now understanding science more. Keep up your dedication and hard work. Thank you, Asma. Asma has been brilliant. Danielle is doing very well in science. Excellent feedback from her teachers. Give Asma all the credit for her hard work and patience. I know you will help Danielle to achieve the best in her GCSE next year. Thank you.",
    "subject": "Secondary (11 to 14 years) Chemistry tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Jane Ross",
    "date": "05/04/2019",
    "feedback": "Asma is an excellent tutor and I highly recommend her to anyone struggling in Physics, Chemistry and Maths. She had helped my daughter gain a newfound enjoyment and confidence in the subjects that Asma tutored her on.",
    "subject": "GCSE or National 3-5 Chemistry tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Rizwan Ahmad",
    "date": "08/09/2019",
    "feedback": "Asma has been brilliant for my daughter. When we started tuition for physics, my daughter had lots of difficulties and at the end, she scored 9 in GCSE, which tells all about Asma. I would definitely recommend Asma. Thanks for your hard work.",
    "subject": "GCSE or National 3-5 Physics tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Lawunmi Adekunte",
    "date": "11/06/2017",
    "feedback": "If you are looking for a tutor who will guide, teach, and challenge you, look no further! Asma is an excellent tutor because she is patient and tailored the learning to my needs. I joined Asma when I was not confident in maths and not getting good marks. Now, I have achieved a grade 9 in my GCSE maths and I will be taking A level maths. I’m so grateful for all the hard work and effort Asma put into each of our lessons. Thank you so much Asma!",
    "subject": "Secondary (11 to 14 years) Maths tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Maureen Macmillan",
    "date": "20/04/2020",
    "feedback": "Asma is an excellent tutor. She makes maths and physics easy to understand.",
    "subject": "Secondary (11 to 14 years) Physics tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Elizabeth Stone",
    "date": "04/09/2018",
    "feedback": "I am extremely happy, grateful and honoured that my child was taught by Asma. Despite Asma not having a dyslexic teaching background, my child was able to develop confidence, interest, and high grades in all three sciences thanks to Asma's tailored and detailed teaching. I highly recommend her.",
    "subject": "GCSE or National 3-5 Chemistry tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Jing Han",
    "date": "27/02/2020",
    "feedback": "Very good one, my boy likes the lessons. Asma worked with our son in preparation for his GCSE Maths exam. Asma provided excellent weekly support, our son enjoyed the sessions and completed additional homework set by Asma. We were all delighted by his recent mock exam results which he reached with Asma's excellent tutoring.",
    "subject": "Secondary (11 to 14 years) Chemistry tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  },
  {
    "name": "Eddy Yang",
    "date": "11/07/2022",
    "feedback": "We are delighted that we found Asma. She is very organised and kind, and we have seen marked progress for our son. His confidence in maths has increased along with his marks. He scored significantly higher in his GCSE mocks after just six months of tuition with Asma.",
    "subject": "A-Level, IB or Highers Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Wojciech",
    "date": "12/03/2023",
    "feedback": "Asma is the best educator and mentor my 13yo son could ever hope for. He's mathematically gifted and asked us to find someone who could help him take his skills to the next level. Asma's impressive academic background coupled with unique experience with applied maths caught our attention immediately. After the first lesson it became quite clear that her credentials just a part of what she has to offer. Asma has an incredible gift for explaining complex topics in a very digestible and entertaining way. She has expert knowledge of a plethora of maths topics and is always prepared to present the most fun and challenging ways to tackle those. After a short while my son begged us to set up a twice- instead of once-per week tutoring sessions because he just couldn't have enough of her teaching. Asma is an amazing professional, with great attitude, experience and talent for sparking interest and motivation in her students. We couldn't ask for a better tutor for our son.",
    "subject": "Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Lucy",
    "date": "10/02/2023",
    "feedback": "Asma has quickly established a way of working with my daughter and the improvement and confidence in her A-level maths is significant. Her grade improved from a D to a B in just 5 months. I’m delighted.",
    "subject": "A-Level Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Charlotte",
    "date": "05/01/2023",
    "feedback": "Asma has been a brilliant maths GCSE tutor for my daughter. Predicted a 5 in GCSE higher maths at the start of Year 11, she has come out with an 8. Her teachers feedback was that this was the greatest in-year increase in maths grades for any student across the entire school. This is due to Asma's excellent teaching, also her consistent encouragement and support for my child - who came to believe she could do it. Asma is kind, reliable, and extremely good at both maths and teaching. My daughter is delighted with the results she has a achieved and as parent I can't thank Asma enough for all her help.",
    "subject": "GCSE Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Gemma",
    "date": "20/11/2022",
    "feedback": "Asma tutored our daughter for GCSE, mainly Chemistry but also Biology and Physics. Our daughter struggled with Chemistry and Physics and was not that motivated to study these subjects. Asma taught the subjects in such a way that our daughter found them interesting and after every lesson said, ‘Asma is amazing, she knows so much stuff’. She really enjoyed the lessons. Asma is able to teach in a way that suits the student and can work at their pace. She has a friendly and calm demeanour which my daughter really liked. We will be using Asma again in the future for our other daughter for sure. Thank you Asma for giving your time and creating a learning environment which resulted in a real confidence in the subjects.",
    "subject": "GCSE Chemistry, Biology, and Physics tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Jen",
    "date": "15/09/2022",
    "feedback": "Asma has reignited my son’s love for maths after he lost interest in the subject in secondary school. She has challenged him and got the cogs in his mind turning while keeping it fun and educational. He has thoroughly enjoyed working with Asma and looks forward to their lessons. We couldn’t be more thankful as he goes in to face his GCSE’s with passion for the subject and Asma by his side.",
    "subject": "GCSE Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Nicky",
    "date": "08/08/2022",
    "feedback": "Asma worked with my son across maths and the sciences. We had a very agile set up which adjusted to his needs as his knowledge progressed, meaning that the time was spent on whatever subject was most needed at the time which was great for us. Asma's knowledge and approach was invaluable. Sam excelled in his GCSEs as a result, outstripping his pre-tutoring predictions by at least two grades in each subject and a 9 in maths. Crucially, he was accepted at his chosen 6th form college and has decided to study an additional subject - further maths - which is testament to Asma's tutoring. He is a far more confident mathematician and scientist thanks to Asma and we can't recommend her highly enough.",
    "subject": "GCSE Maths and Sciences tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Carolyn",
    "date": "22/05/2022",
    "feedback": "We would most definitely highly recommend Asma. She is an incredible tutor, extremely helpful, caring , dedicated, patient and always willing to go the extra mile. Maths has always been my son’s weakest subject and it has long been a struggle for him. Within 8 months of tutoring under Asma, the GCSE Maths result he achieved was an incredible improvement from grade 2 to a Grade 6 and all within a relatively short space of time. Asma is such a lovely person and takes the time to understand her student and what works best for them as no two students are the same. Without Asma’s unwavering support, achieving a GCSE grade that is 4 grades higher than prior to starting with Asma in Year 11 would have been only a dream. Thank you very much Asma - you’re a star!",
    "subject": "GCSE Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Emma",
    "date": "14/04/2022",
    "feedback": "Asma has been incredibly helpful for our son. She has encouraged his understanding and interest in Chemistry and he is much happier about his upcoming GCSE. His mock results have gone from a grade 3 to a 9, which has been a real boost for his confidence.",
    "subject": "GCSE Chemistry tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Kat",
    "date": "03/03/2022",
    "feedback": "We are delighted that we found Asma on this site. The reviews sounded excellent and our experience with her over the last six months has been in line with that. She is very organised and kind, she adapts to the need of the child and we have seen marked progress for our son. His confidence in maths has increased along with his marks. He struggled with maths last year and scraped a 6 before he started with Asma. Six months later he managed just a few marks off an 8 in his recent GCSE mocks. Our son is delighted with the improvement.",
    "subject": "GCSE Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Kirsten",
    "date": "25/02/2022",
    "feedback": "Asma is an excellent tutor who has been helping my son with areas he has struggled with for years as he approaches gcse - it’s wonderful seeing his abilities and confidence grow, he hated maths before and is now helping his friends with it and talking about considering it for A level. He said a lesson with her is like a whole terms worth of learning at school! Super nice and very professional too highly recommend.",
    "subject": "GCSE Maths tuition",
    "feedbackDate": "15/07/2023",
    "stars": 5
  },
  {
    "name": "Rizwan",
    "date": "08/09/2019",
    "feedback": "Asma has been brilliant for my daughter, When we started tuition for physics, my daughter had lots of difficulties and at the end, she scored 9 in GCSE, which tells all about Asma. I would definitely recommend Asma. Thanks for your hard work.",
    "subject": "GCSE Physics tuition",
    "feedbackDate": "17/07/2023",
    "stars": 5
  }
]